# Introduction to Pandas

In [1]:
import pandas as pd

## series

In [4]:
pd.Series([1, 1, 2, 3, 5, 8])

0    1
1    1
2    2
3    3
4    5
5    8
dtype: int64

In [5]:
pd.Series({"Tomato": 10, "Onion":5, "Gracicl":2})

Tomato     10
Onion       5
Gracicl     2
dtype: int64

## DataFrame

In [8]:
data = [
    ["Peter Parker", "pparker@yahoo.com", 16],
    ["Tony Stark", "god@stark.com", 35],
    ["Steven Rogers", "capstevenrogers@hotmail", 85]
]

pd.DataFrame(data, columns=["Name", "Email", "Age"])

            Name                    Email  Age
0   Peter Parker        pparker@yahoo.com   16
1     Tony Stark            god@stark.com   35
2  Steven Rogers  capstevenrogers@hotmail   85

In [10]:
data = {
    "Name": ["Peter Parker", "Tony Stark", "Steven Rogers"],
    "Email": ["pparker@yahoo.com", "god@stark.com", "capstevenrogers@hotmail"],
    "Age": [16, 35, 85]
}

pd.DataFrame(data, columns=["Name", "Email", "Age"])

            Name                    Email  Age
0   Peter Parker        pparker@yahoo.com   16
1     Tony Stark            god@stark.com   35
2  Steven Rogers  capstevenrogers@hotmail   85

## CSV

In [57]:
exam_scores = pd.read_csv("https://raw.githubusercontent.com/dphi-official/Datasets/master/exam_scores.csv")
exam_scores.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71

In [58]:
exam_scores.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [73]:
sma_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/Datasets/master/Standard_Metropolitan_Areas_Data-data.csv")
sma_data.shape

(99, 10)

In [74]:
sma_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   land_area       99 non-null     int64
 1   percent_city    99 non-null     float64
 2   percent_senior  99 non-null     float64
 3   physicians      99 non-null     int64
 4   hospital_beds   99 non-null     int64
 5   graduates       99 non-null     float64
 6   work_force      99 non-null     float64
 7   income          99 non-null     int64
 8   region          99 non-null     int64
 9   crime_rate      99 non-null     float64
dtypes: float64(5), int64(5)
memory usage: 7.9 KB

In [75]:
sma_data[["land_area", "graduates"]].head()

   land_area  graduates
0       1384       50.1
1       3719       53.9
2       3553       50.6
3       3916       52.2
4       2480       66.1

In [76]:
sma_data.iloc[0:2, -2:]

   region  crime_rate
0       1       75.55
1       2       56.03

In [77]:
sma_data.loc[0:2, ["region", "work_force"]]

   region  work_force
0       1      4083.9
1       2      3305.9
2       1      2066.3

In [78]:
sma_data.region == 1

0      True
1     False
2      True
3     False
4     False
      ...
94    False
95    False
96    False
97     True
98    False
Name: region, Length: 99, dtype: bool

In [79]:
sma_data[data.region == 1].head()

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
0,1384,78.1,12.3,25627,69678,50.1,4083.9,72100,1,75.55
2,3553,37.4,10.7,9724,33731,50.6,2066.3,33216,1,41.32
8,3049,19.5,12.1,4005,21149,53.4,967.5,15826,1,30.51
10,1008,16.6,10.3,4006,16704,55.9,935.5,15953,1,54.16
24,2966,26.9,10.3,2053,6604,56.3,450.4,6966,1,56.55

### quiz

Use the index-based selection technique to select the 10th observation from data frame sma_data. What is the crime_rate for this observation? [Remember indexing in Python starts with 0, so if you have to select nth observation, you should get the observation present at index n-1]

In [66]:
sma_data.iloc[9].crime_rate

55.3

Select the physicians column. Get the last value from physicians column.

In [67]:
sma_data.physicians.iloc[-1]

140

Select the records with index labels (numerical positions) - 1, 3, 5, 7, 9 and 13 and columns - 'land_area', 'work_force', 'income', 'region' and 'crime_rate'. Assign the result to a variable sample_data1. Select the correct statement about this sample_data1. [Hint: Use label-based selection technique]

In [68]:
sample_data1 = sma_data.loc[[1, 3, 5, 7, 9, 13], ['land_area', 'work_force', 'income', 'region', 'crime_rate']]
sample_data1

    land_area  work_force  income  region  crime_rate
1        3719      3305.9   54542       2       56.03
3        3916      1966.7   32906       2       67.38
5        2815      1541.9   25663       3       58.48
7        6794      1272.7   18221       3       64.88
9        4647      1032.2   14542       2       55.30
13        782       915.2   12591       4       63.20

Select the observations for which the region is equal to 2. Assign the result to a variable sample_data2. How many observations are there in the dataframe sample_data2? [Hint: sma_data.region is equal to?]

In [69]:
sample_data2 = sma_data[sma_data.region == 2]
sample_data2.shape

(25, 10)

## Summary Functions

In [70]:
exam_scores.describe(include="all")

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1000,1000,1000,1000,1000,1000.000000,1000.00000,1000.000000
unique,2,5,6,2,2,NaN,NaN,NaN
top,female,group C,some college,standard,none,NaN,NaN,NaN
freq,502,294,226,649,654,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,67.128000,70.17400,68.973000
std,NaN,NaN,NaN,NaN,NaN,14.815367,14.85599,15.109155
min,NaN,NaN,NaN,NaN,NaN,15.000000,18.00000,10.000000
25%,NaN,NaN,NaN,NaN,NaN,58.000000,60.00000,59.000000
50%,NaN,NaN,NaN,NaN,NaN,67.000000,70.00000,69.000000
75%,NaN,NaN,NaN,NaN,NaN,78.000000,81.00000,80.000000
max,NaN,NaN,NaN,NaN,NaN,100.000000,100.00000,100.000000

In [71]:
exam_scores.gender.describe()

count       1000
unique         2
top       female
freq         502
Name: gender, dtype: object

### Quiz

Use mean() method on the dataframe sma_data and select the correct statements.

In [80]:
sma_data.mean()

land_area         2615.727273
percent_city        42.518182
percent_senior       9.781818
physicians        1828.333333
hospital_beds     6345.868687
graduates           54.463636
work_force         449.366667
income            6762.505051
region               2.494949
crime_rate          55.643030
dtype: float64

Use unique() for the column region. How many unique values are there in this column?

In [82]:
len(sma_data.region.unique())

4

Select the correct statement about the sma_data. [Hint: Summary function - describe()][Note: For us (humans) 769.0 and 769 are same]

In [83]:
sma_data.describe()

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
count,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000
mean,2615.727273,42.518182,9.781818,1828.333333,6345.868687,54.463636,449.366667,6762.505051,2.494949,55.643030
std,3045.826210,17.348277,2.524547,3192.199763,9136.202716,7.773286,610.990885,10393.349660,1.013921,13.470943
min,47.000000,13.400000,3.900000,140.000000,481.000000,30.300000,66.900000,769.000000,1.000000,23.320000
25%,1408.000000,30.100000,8.350000,459.000000,2390.000000,50.250000,150.300000,2003.000000,2.000000,46.115000
50%,1951.000000,39.500000,9.700000,774.000000,3472.000000,54.000000,257.200000,3510.000000,3.000000,56.060000
75%,2890.500000,52.600000,10.750000,1911.500000,6386.500000,58.300000,436.500000,6283.500000,3.000000,63.860000
max,27293.000000,100.000000,21.800000,25627.000000,69678.000000,72.800000,4083.900000,72100.000000,4.000000,85.620000

Select the observations from the dataframe sma_data where the region is equal to 3. Name this selected data as sample_data1. select the correct options about sample_data1.

In [85]:
sample_data1 = sma_data[sma_data.region == 3]
sample_data1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 36 entries, 5 to 98
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   land_area       36 non-null     int64
 1   percent_city    36 non-null     float64
 2   percent_senior  36 non-null     float64
 3   physicians      36 non-null     int64
 4   hospital_beds   36 non-null     int64
 5   graduates       36 non-null     float64
 6   work_force      36 non-null     float64
 7   income          36 non-null     int64
 8   region          36 non-null     int64
 9   crime_rate      36 non-null     float64
dtypes: float64(5), int64(5)
memory usage: 3.1 KB

In [87]:
sample_data1.describe(include="all")

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
count,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.0,36.000000
mean,2485.972222,46.172222,9.283333,1313.722222,4962.777778,51.002778,343.797222,4806.861111,3.0,58.265556
std,1653.813800,19.101019,3.458199,1459.654903,3879.692625,7.328164,354.312228,5452.647656,0.0,10.155822
min,654.000000,14.500000,3.900000,140.000000,481.000000,30.300000,66.900000,769.000000,3.0,36.360000
25%,1517.000000,31.350000,7.600000,509.750000,2483.500000,46.950000,146.200000,1940.750000,3.0,52.447500
50%,2018.000000,47.000000,8.850000,767.000000,3876.000000,50.950000,230.550000,2976.500000,3.0,58.725000
75%,2911.000000,59.725000,9.975000,1583.500000,5811.750000,55.175000,366.950000,4829.500000,3.0,64.922500
max,8360.000000,90.700000,21.800000,7340.000000,16941.000000,70.700000,1541.900000,25663.000000,3.0,76.350000

Count the occurence of unique values in the column region of the dataframe sma_data. Select the correct statements. [Hint: value_counts()]

In [90]:
sma_data.region.value_counts()

region
3    36
2    25
1    21
4    17
Name: count, dtype: int64

## Sorting and renaming

### quiz

Sort the dataframe by crime rate in descending order. [Note: The default sorting is in ascending order]. Assign the sorted data to a variable sorted_data1. The first five observations of the dataframe sorted_data1 has the same region. Which region is that?

In [94]:
sorted_data1 = sma_data.sort_values(by="crime_rate", ascending=False)
sorted_data1.head()

,land_area,percent_city,percent_senior,num_physicians,hospital_beds,graduates,work_force,income,region,crime_rate
20,9155,53.8,11.1,2280,6450,60.1,575.2,7766,4,85.62
74,1412,39.2,11.3,436,1837,49.4,154.2,2098,4,82.68
53,5966,39.5,9.6,737,1907,52.7,246.6,3007,4,80.94
4,2480,31.5,10.5,8502,16751,66.1,1514.5,26573,4,80.19
67,8152,22.3,9.1,405,1254,51.7,165.6,2257,4,78.10

Which of the following set of code will help you to rename the column physicians in the original dataframe?

In [93]:
sma_data.rename(columns = {'physicians': 'num_physicians'}, inplace = True)
sma_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   land_area       99 non-null     int64
 1   percent_city    99 non-null     float64
 2   percent_senior  99 non-null     float64
 3   num_physicians  99 non-null     int64
 4   hospital_beds   99 non-null     int64
 5   graduates       99 non-null     float64
 6   work_force      99 non-null     float64
 7   income          99 non-null     int64
 8   region          99 non-null     int64
 9   crime_rate      99 non-null     float64
dtypes: float64(5), int64(5)
memory usage: 7.9 KB

## Checking and Filling Missing Data

In [100]:
exam_scores.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [101]:
exam_scores.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [102]:
exam_scores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

### quiz

In [103]:
titanic_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/Datasets/master/titanic_data.csv")
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Find the mean value of Age column and assign it to a variable age_mean_before. Fill the missing value of the column Age with the mean value i.e. age_mean_before. [To calculate mean you can directly use mean() method on the Age column]. After filling the missing value of the column Age, find the mean of column Age again and assign it to a variable age_mean_after. Select the correct answer.

In [108]:
age_mean_before = titanic_data.Age.mean()
age_mean_before

29.69911764705882

In [117]:
titanic_data.Age.fillna(age_mean_before, inplace=True)
titanic_data.Age[titanic_data.Age.isnull()]

Series([], Name: Age, dtype: float64)

In [118]:
age_mean_after = titanic_data.Age.mean()
age_mean_after

29.69911764705882

Find the maximum occurring value/category in the column Embarked [Hint: value_counts()]. Fill the missing value in this column Embarked with the maximum occurring value. Select the correct statement.

In [121]:
titanic_data.Embarked.value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64